### **Standard lib imports**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
from pathlib import Path

### **Load Data**

In [2]:
ROOT_PATH = Path(os.getcwd()).parent
DATA_PATH = ROOT_PATH / 'data'

In [7]:
# Get a list of all csv files in the data folder

fnames = [f for f in os.listdir(DATA_PATH) if f.endswith('.csv')]
fnames.sort()

In [8]:
fnames

['Availability.csv',
 'Prices.csv',
 'Product Details.csv',
 'Purchase.csv',
 'Sales.csv',
 'Visits on PDP.csv']

In [9]:
read_file = lambda fname: pd.read_csv(DATA_PATH / fname)

In [10]:
# Load in the above csv files

files = []

for fname in fnames:
    files.append(read_file(fname))
    
availability = files[0]
prices = files[1]
product_details = files[2]
purchase = files[3]
sales = files[4]
visits_on_pdp = files[5]

### **Inspect each dataset**

#### **1. Availability**

In [11]:
availability.head()

,PRODUCT_ID,DATE,A1_AVAILABLE,A2_AVAILABLE,A3_AVAILABLE,A4_AVAILABLE
0,309672547,2020-01-02,NaN,1.0,NaN,NaN
1,333820462,2020-01-02,1.0,1.0,NaN,NaN
2,270239865,2020-01-02,NaN,1.0,1.0,NaN
3,330177900,2020-01-02,NaN,1.0,NaN,NaN
4,289099769,2020-01-02,NaN,1.0,NaN,NaN

In [12]:
print(f"Shape of data: {availability.shape}")

Shape of data: (749510, 6)

In [13]:
availability.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 749510 entries, 0 to 749509
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   PRODUCT_ID    749510 non-null  int64
 1   DATE          749510 non-null  object
 2   A1_AVAILABLE  418121 non-null  float64
 3   A2_AVAILABLE  486312 non-null  float64
 4   A3_AVAILABLE  292561 non-null  float64
 5   A4_AVAILABLE  48741 non-null   float64
dtypes: float64(4), int64(1), object(1)
memory usage: 34.3+ MB

#### **2. Prices**

In [14]:
prices.head()

,PRODUCT_ID,SALE_A1,SALE_A2,SALE_A3,SALE_A4,PURCHASE_A1,PURCHASE_A2,PURCHASE_A3,PURCHASE_A4,VALID_FROM,VALID_TO
0,270239865,18199,16799,12999,12199,10097,7851,3576,3290,2020-01-14T11:04:45.153+01:00,2020-01-14T12:45:30.042+01:00
1,337148188,242999,206399,197999,193999,177477,147779,141648,35553,2020-06-17T09:43:29.921+02:00,2020-06-18T09:16:31.401+02:00
2,341257331,70299,65399,57899,40499,54206,47594,44206,0,2020-02-28T10:50:17.647+01:00,2020-02-28T11:36:39.077+01:00
3,330479809,4099,3799,2299,1099,1287,1084,0,0,2020-02-28T11:39:46.102+01:00,2020-03-02T12:46:29.355+01:00
4,319791009,70799,61399,57899,32299,56158,48876,44067,22051,2020-01-27T08:15:27.795+01:00,2020-01-27T14:00:10.857+01:00

In [24]:
print(f"Shape of data: {prices.shape}")

Shape of data: (655674, 11)

In [25]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 655674 entries, 0 to 655673
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PRODUCT_ID   655674 non-null  int64
 1   SALE_A1      655674 non-null  int64
 2   SALE_A2      655674 non-null  int64
 3   SALE_A3      655674 non-null  int64
 4   SALE_A4      655674 non-null  int64
 5   PURCHASE_A1  655674 non-null  int64
 6   PURCHASE_A2  655674 non-null  int64
 7   PURCHASE_A3  655674 non-null  int64
 8   PURCHASE_A4  655674 non-null  int64
 9   VALID_FROM   655674 non-null  object
 10  VALID_TO     655674 non-null  object
dtypes: int64(9), object(2)
memory usage: 55.0+ MB

#### **3. Product Details**

In [27]:
product_details.head()

   PRODUCT_ID*31     MANUFACTURER MAIN_CATEGORY
0      283509384            Apple         Handy
1      241663414           Tamron       Kameras
2      103621251  ASUSTeKCOMPUTER       Tablets
3      336228170        Libratone  Audio & Hifi
4      330385166            Apple        Laptop

In [40]:
# CLean the column name

product_details = product_details.rename({'PRODUCT_ID*31': 'PRODUCT_ID'}, axis=1)

In [41]:
print(f"Shape of data: {product_details.shape}")

Shape of data: (10534, 3)

In [42]:
product_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10534 entries, 0 to 10533
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PRODUCT_ID     10534 non-null  int64
 1   MANUFACTURER   10506 non-null  object
 2   MAIN_CATEGORY  10534 non-null  object
dtypes: int64(1), object(2)
memory usage: 247.0+ KB

**How many product categories exist? What are they?**

In [48]:
print(f"Number of product categories: {product_details['MAIN_CATEGORY'].nunique()}")

Number of product categories: 10

In [45]:
# Distinct product categories

product_details['MAIN_CATEGORY'].unique().tolist()

['Handy',
 'Kameras',
 'Tablets',
 'Audio & Hifi',
 'Laptop',
 'Wearables',
 'Konsolen',
 'Apple',
 'Electronic Accessories',
 'Konsolenzubehör']

**How many manufacturers exist? Who are they?**

In [49]:
print(f"Number of manufacturers: {product_details['MANUFACTURER'].nunique()}")

Number of manufacturers: 101

In [46]:
product_details['MANUFACTURER'].unique()

array(['Apple', 'Tamron', 'ASUSTeKCOMPUTER', 'Libratone', 'Oppo',
       'Samsung', 'Nikon', 'Panasonic', 'Sony', 'Huawei', 'Canon', 'YI',
       'Xiaomi', 'HTC', 'Acer', 'Microsoft', 'Fossil', 'Sigma',
       'Sennheiser', 'Lenovo', 'OnePlus', 'JBL', 'Tolino', 'Vifa',
       'LGElectronics', 'Fujifilm', 'ZTE', 'Bose', 'Nokia', 'Garmin',
       'Olympus', 'Nintendo', 'Audeze', 'Google', 'Wiko', 'TomTom',
       'BeatsElectronics', 'tonies', 'Canton', 'LG', 'HouseofMarley',
       'Pentax', nan, 'Motorola', 'MasterDynamic', 'TrekStor', 'Denon',
       'Teufel', 'fitbit', 'Amazon', 'BeatsbyDrDre', 'BangOlufsen',
       'Kobo', 'UltimateEars', 'GoPro', 'Philips', 'Fairphone', 'Klipsch',
       'Marshall', 'audiotechnica', 'NVIDIA', 'Polar', 'HarmanKardon',
       'harmankardon', 'Magnat', 'Riva', 'Caseable', 'Creative', 'Asus',
       'PocketBook', 'Yamaha', 'Urbanears', 'AKG', 'Onkyo', 'Dockin',
       'Icarus', 'BowersWilkins', 'Sonos', 'Axdia', 'Woodcessories',
       'Medion', 'Mobvoi', 'Wortmann', 'Zeiss', 'RedOctane', 'OnePLus',
       'Vivitar', 'AtGames', 'Easypix', 'Minolta', 'Pioneer',
       'DistriRead', 'MASElektronik', 'Harmonix', 'KonicaMinolta',
       'Rollei', 'Sega', 'Extreme', 'KOBO', 'Millenium', 'BeatsbyDrDer',
       'Konica'], dtype=object)

**4. Sales**

In [30]:
sales.head()

         DATE  PRODUCT_ID  QUANTITY
0  2020-01-18   341844533         8
1  2020-03-26   316010280         1
2  2020-06-08   316010280         1
3  2020-01-03   319993687         1
4  2020-06-19   319993687         3

In [31]:
print(f"Shape of data: {sales.shape}")

Shape of data: (169972, 3)

In [32]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169972 entries, 0 to 169971
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   DATE        169972 non-null  object
 1   PRODUCT_ID  169972 non-null  int64
 2   QUANTITY    169972 non-null  int64
dtypes: int64(2), object(1)
memory usage: 3.9+ MB

**5. Visits on PDP**

In [34]:
visits_on_pdp.head()

         DATE  PRODUCT_ID  QUANTITY
0  2020-11-30   326726608         1
1  2020-01-06   334009500         4
2  2020-08-17   334009500         2
3  2020-03-17   334009500         1
4  2020-09-21   334009500         1

In [35]:
print(f"Shape of data: {visits_on_pdp.shape}")

Shape of data: (180126, 3)

In [36]:
visits_on_pdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180126 entries, 0 to 180125
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   DATE        180126 non-null  object
 1   PRODUCT_ID  180126 non-null  int64
 2   QUANTITY    180126 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.1+ MB